<img src="LaeCodes.png" 
     align="center" 
     width="100" />

# Introduction to Pandas 

Pandas is a flexible open-source data analysis and manipulation library for Python. It is widely used in data science for working with structured data due to its easy-to-use data structures and robust functionality. Pandas provides tools for reading and writing data, cleaning and preparing data, and performing complex data analysis.

**Key Features of Pandas**

**1)Data Structures:** <br>
**Series:** A one-dimensional labeled array capable of holding any data type.

In [2]:
import pandas as pd
s = pd.Series([1, 2, 3, 4, 5])

**Attributes:** <br>
- **values:** Returns the values in the series. <br>
- **index:** Returns the index of the series. <br>

**DataFrame:** A two-dimensional labeled data structure with columns of potentially different types. It is similar to a table in a relational database or an Excel spreadsheet.

In [3]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)
print(df)

   A  B
0  1  4
1  2  5
2  3  6

**Attributes:** <br>
- **columns:** Returns the column labels.
- **index:** Returns the row labels. <br>
- **values:** Returns the underlying data as a NumPy array. 

**2) Data Handling and Manipulation:**
- Reading/Writing Data: Easily read from and write to various file formats, including CSV, Excel, SQL, and JSON. 
- Data Cleaning: Handling missing data, removing duplicates, and filtering data.
- Data Transformation: Applying functions, merging/joining datasets, grouping data, and pivoting tables.

**3) Indexing and Selection:**
- Powerful tools for selecting, filtering, and slicing data, allowing for intuitive data access and manipulation. 

**4) Time Series Handling:**
- Specialized functions and tools to work with time series data, including date range generation, frequency conversion, and resampling.

**5) Integration with Other Libraries:**
- Works seamlessly with NumPy for numerical operations and matplotlib for data visualization.

**Common Uses of Pandas in Data Science**
- **Data Cleaning and Preparation:**
    - Handling missing values, converting data types, and normalizing data.
    - Removing duplicates and handling outliers.
- **Exploratory Data Analysis (EDA):**
    - Summarizing data, calculating statistics, and generating descriptive statistics.
    - Visualizing data distributions and relationships using plots.
- **Data Transformation:**
    - Applying functions to data, grouping and aggregating data, and reshaping data structures.
    - Creating new calculated columns based on existing data.
- **Merging and Joining Data:**
    - Combining multiple datasets through joins and merges, similar to SQL operations.
- **Time Series Analysis:**
    - Handling date-time data, performing rolling window calculations, and resampling time series data. <br>


**Creating DataFrames from Various Data Sources** <br>
- **From Dictionaries:**

In [4]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)

• **From CSV Files:**

In [5]:
df = pd.read_csv('data.csv', delimiter=';')
print(df)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner   2.0
1       10.34  1.66    Male     No  Sun  Dinner   3.0
2       21.01  3.50    Male     No  Sun  Dinner   3.0
3       23.68  3.31    Male     No  Sun  Dinner   2.0
4       24.59  3.61  Female     No  Sun  Dinner   4.0
5         NaN   NaN     NaN    NaN  NaN     NaN   NaN

• **From Excel Files:**

In [8]:
import pandas as pd

df = pd.read_excel('data.xlsx', engine='openpyxl')

print(df.head())

   A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

• **From JSON Files:**

In [24]:
import json
import pandas as pd

# Define the file path
file_path = 'data.json'

# Step 1: Read the JSON file
try:
    with open(file_path, 'r', encoding='utf-8-sig') as file:
        content = json.load(file)
        print("File Content:", content)
except FileNotFoundError:
    print(f"The file {file_path} does not exist.")
    content = None
except json.JSONDecodeError:
    print("Invalid JSON format.")
    content = None

# Step 2: Convert to DataFrame if content is valid
if content:
    try:
        df = pd.DataFrame(content)
        print(df.head())
    except ValueError:
        print("JSON format not suitable for a DataFrame.")

File Content: {'name': ['Alice', 'Bob', 'Charlie'], 'age': [25, 30, 35], 'city': ['New York', 'Los Angeles', 'Chicago']}
      name  age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

• **From SQL Databases:**

In [31]:
import sqlite3
import pandas as pd

# Step 1: Create a database and insert sample data
def create_database():
    # Connect to SQLite database (creates the file if it doesn't exist)
    conn = sqlite3.connect('database.db')
    cursor = conn.cursor()

    # Create a sample table
    cursor.execute('''
    CREATE TABLE IF NOT EXISTS employees (
        id INTEGER PRIMARY KEY,
        name TEXT,
        age INTEGER,
        department TEXT
    )
    ''')

    # Insert sample data
    cursor.executemany('''
    INSERT INTO employees (name, age, department)
    VALUES (?, ?, ?)
    ''', [
        ('Alice', 25, 'HR'),
        ('Bob', 30, 'Engineering'),
        ('Charlie', 35, 'Marketing')
    ])

    # Commit changes and close the connection
    conn.commit()
    conn.close()
    print("Database created with sample data!")

# Step 2: Connect to the database and read data
def query_database():
    # Connect to the SQLite database
    conn = sqlite3.connect('database.db')

    # Query the data using pandas
    try:
        df = pd.read_sql_query("SELECT * FROM employees", conn)
        print("Data retrieved from the database:")
        print(df)
    except Exception as e:
        print(f"Error querying database: {e}")
    finally:
        conn.close()

# Main script execution
if __name__ == '__main__':
    print("Creating database...")
    create_database()

    print("\nQuerying database...")
    query_database()

Creating database...
Database created with sample data!

Querying database...
Data retrieved from the database:
   id     name  age   department
0   1    Alice   25           HR
1   2      Bob   30  Engineering
2   3  Charlie   35    Marketing
3   4    Alice   25           HR
4   5      Bob   30  Engineering
5   6  Charlie   35    Marketing

**DataFrame Indexing and Slicing**
- **Selecting Data by Label:**
    - **Using loc for label-based indexing:**

In [33]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)

df.loc[0, 'A']  # Access element at row 0, column 'A'
df.loc[:, 'A']  # Access all rows of column 'A'
df.loc[0]       # Access all columns of row 0

A    1
B    4
Name: 0, dtype: int64

- **Selecting Data by Position:**
    - **Using iloc for position-based indexing:**

In [34]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)

df.iloc[0, 0]   # Access element at first row, first column
df.iloc[:, 0]   # Access all rows of first column
df.iloc[0]      # Access all columns of first row

A    1
B    4
Name: 0, dtype: int64

- **Boolean Indexing:**
    - **Using conditions to filter data:**

In [35]:
df[df['A'] > 2]  # Returns rows where column 'A' values are greater than 2

   A  B
2  3  6

- **Setting Values:**
    - **Modifying values based on index:**

In [36]:
df.loc[0, 'A'] = 10  # Set value at row 0, column 'A' to 10

**Basic Operations on DataFrames**
- **Adding and Removing Columns:** 
    - **Adding a new column:**

In [37]:
df['C'] = [7, 8, 9]
print(df)

    A  B  C
0  10  4  7
1   2  5  8
2   3  6  9

   - **Removing a column:**

In [38]:
df.drop('C', axis=1, inplace=True)
print(df)

    A  B
0  10  4
1   2  5
2   3  6

- **Filtering Rows:**
    - **Filtering based on conditions:**

In [39]:
filtered_df = df[df['A'] > 1]

- **Sorting Data:**
    - **Sorting by column values:**

In [43]:
df.sort_values(by='A', ascending=True)

    A  B
1   2  5
2   3  6
0  10  4

- **Sorting by index:**

In [44]:
df.sort_index()

    A  B
0  10  4
1   2  5
2   3  6

- **Descriptive Statistics:**
    - **Summary statistics for DataFrame:**

In [45]:
df.describe()

               A    B
count   3.000000  3.0
mean    5.000000  5.0
std     4.358899  1.0
min     2.000000  4.0
25%     2.500000  4.5
50%     3.000000  5.0
75%     6.500000  5.5
max    10.000000  6.0

**Data Cleaning and Preparation**
- **Handling Missing Data:**
    - **Detecting missing values:**

In [61]:
import pandas as pd
import numpy as np

# Create a DataFrame
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)

# Add NaN values
df.loc[1, 'A'] = np.nan  # Set a specific value to NaN
df.loc[2, 'B'] = np.nan 

df.isnull()

       A      B
0  False  False
1   True  False
2  False   True

- **Dropping missing values:**

In [51]:
df.dropna()

     A    B
0  1.0  4.0

- **Filling missing values:**

In [58]:
df.fillna(value=0)

     A    B
0  1.0  4.0
1  0.0  5.0
2  3.0  0.0

**Data Transformation:** 
- **Renaming columns:**

In [62]:
df.rename(columns={'A': 'Column_A'}, inplace=True)
print(df)

   Column_A    B
0       1.0  4.0
1       NaN  5.0
2       3.0  NaN

• **Changing data types:**

In [64]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)

df['B'] = df['B'].astype(float)
df

   A    B
0  1  4.0
1  2  5.0
2  3  6.0

**Combining and Merging DataFrames:**
- **Concatenating DataFrames:**

In [71]:
#Concatenating on columns

data1 = {'A': [1, 2, 3], 'B': [4, 5, 6]}
data2 = {'C': [7, 8, 9], 'D': [10, 11, 12]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

result = pd.concat([df1, df2], axis=1)
print(result)

   A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [74]:
#Handling different number of rows

df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4, 5]})

result = pd.concat([df1, df2], axis=1)
print(result)

     A  B
0  1.0  3
1  2.0  4
2  NaN  5

In [78]:
# Resetting the index for alignment
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4, 5]})

result = pd.concat([df1.reset_index(drop=True), df2.reset_index(drop=True)], axis=1).dropna()
print(result)

     A  B
0  1.0  3
1  2.0  4

In [77]:
#Concatenatinng with duplicate column names
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'A': [3, 4]})

result = pd.concat([df1, df2], axis=1)
print(result)

   A  A
0  1  3
1  2  4

In [69]:
#Concatenating on rows

import pandas as pd

df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = pd.DataFrame({'A': [5, 6], 'B': [7, 8]})

# Concatenate along rows
result = pd.concat([df1, df2], axis=0, ignore_index=True) #axis 0 stacks the dataframes vertically (on rows)
print(result)

   A  B
0  1  3
1  2  4
2  5  7
3  6  8

In [70]:
#Concatenating with unequal columns

df3 = pd.DataFrame({'A': [9, 10], 'C': [11, 12]})
result = pd.concat([df1, df3], axis=0, ignore_index=True)
print(result)

    A    B     C
0   1  3.0   NaN
1   2  4.0   NaN
2   9  NaN  11.0
3  10  NaN  12.0

• **Merging DataFrames:**
In Pandas, merging DataFrames is used to combine them based on a key or index. The merge() function is the most versatile method for this.

**Key Parameters of pd.merge()**
1) **on:**
- Specifies the column(s) to merge on. If not specified, it uses the overlapping column names.
2) **how:**
- Determines the type of merge:
    - 'inner' (default): Keeps only matching rows in both DataFrames.
    - 'left': Keeps all rows from the left DataFrame and matching rows from the right.
    - 'right': Keeps all rows from the right DataFrame and matching rows from the left.
    - 'outer': Keeps all rows from both DataFrames, filling NaN where there's no match.

In [81]:
#Example dataframes

import pandas as pd

# Define two DataFrames
df1 = pd.DataFrame({
    'id': [1, 2, 3],
    'name': ['Alice', 'Bob', 'Charlie'],
    'age': [25, 30, 35]
})

df2 = pd.DataFrame({
    'id': [2, 3, 4],
    'department': ['HR', 'Engineering', 'Marketing']
})

In [80]:
#Inner join (Default) - keeps only rows with matching id values in both DataFrames

result = pd.merge(df1, df2, on='id', how='inner')
print(result)

   id     name  age   department
0   2      Bob   30           HR
1   3  Charlie   35  Engineering

In [83]:
# Left join - keeps all rows from the left DatFrame (df1) and adds matching rows from the right DataFrame (df2)

result = pd.merge(df1, df2, on='id', how='left')
print(result)

   id     name  age   department
0   1    Alice   25          NaN
1   2      Bob   30           HR
2   3  Charlie   35  Engineering

In [84]:
# Right Join - Keeps all rows from the right DataFrame (df2) and adds matching rows from the left DataFrame (df1).

result = pd.merge(df1, df2, on='id', how='right')
print(result)

   id     name   age   department
0   2      Bob  30.0           HR
1   3  Charlie  35.0  Engineering
2   4      NaN   NaN    Marketing

In [85]:
# Outer Join - Keeps all rows from both DataFrames, filling NaN where there's no match.

result = pd.merge(df1, df2, on='id', how='outer')
print(result)

   id     name   age   department
0   1    Alice  25.0          NaN
1   2      Bob  30.0           HR
2   3  Charlie  35.0  Engineering
3   4      NaN   NaN    Marketing

In [86]:
# Merging on Multiple Columns - If both DataFrames have multiple columns to match, specify them in on:

df3 = pd.DataFrame({
    'id': [1, 2, 3],
    'name': ['Alice', 'Bob', 'Charlie'],
    'department': ['HR', 'HR', 'Engineering']
})

df4 = pd.DataFrame({
    'id': [2, 3, 4],
    'name': ['Bob', 'Charlie', 'David'],
    'department': ['HR', 'Engineering', 'Marketing']
})

result = pd.merge(df3, df4, on=['id', 'department'], how='inner')
print(result)

   id   name_x   department   name_y
0   2      Bob           HR      Bob
1   3  Charlie  Engineering  Charlie